# https://github.com/Homebrew/homebrew-bundle

tap "1password/tap"
tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jesseduffield/lazygit"
# tap "koekeishiya/formulae"
tap "olets/tap"
tap "oven-sh/bun"
tap "stripe/stripe-cli"
tap "teamookla/speedtest"

# Homebrew
# https://github.com/Homebrew/brew/

# openssl needs to be installed before libyaml, maybe others
brew "openssl@1.1"
brew "openssl@3"

brew "advancecomp"
brew "asciidoctor"
brew "awscli"
brew "bash"
brew "bash-completion"
brew "bat"
brew "btop"
brew "cloc"
brew "cmake"
brew "coreutils"
brew "diff-so-fancy"
brew "docutils"
brew "dos2unix"
brew "eza"
brew "fd"
brew "fish"
brew "fontforge"
brew "fonttools"
brew "fzf"
brew "gh"
brew "gifsicle"
brew "git"
brew "git-quick-stats"
brew "gmp"
brew "gnu-sed"
brew "highlight"
brew "htop"
brew "httpie"
brew "imagemagick"
brew "jhead"
brew "jq"
brew "lazygit"
brew "lazydocker"
brew "less"
brew "libtermkey"
brew "libyaml" # should be installed after openssl
brew "mas"
brew "media-info"
brew "most"
brew "neofetch"
# brew "overmind"
brew "rust"
brew "shellcheck"
brew "sqlite"
brew "ssh-copy-id"
brew "starship"
brew "stow"
brew "wget"
brew "yamllint"
brew "yarn"
brew "zoxide"
brew "nushell"
brew "zellij"
brew "helix"
brew "alacritty"

# homebrew-cask
# https://github.com/Homebrew/homebrew-cask

cask "carbon-copy-cloner"
cask "cleanmymac"
cask "daisydisk"
cask "font-cascadia-code"
cask "font-fira-code"
cask "font-hack"
cask "font-jetbrains-mono"
cask "font-monaspace"
cask "font-source-code-pro"
cask "font-symbols-only-nerd-font"
cask "freedom"
cask "hazel"
cask "hyperkey"
cask "istat-menus"
cask "postico"
cask "screenflick"
cask "tableplus"
cask "viber"
