tap "common-fate/granted"
tap "felixkratz/formulae"
tap "go-task/tap"
tap "homebrew/bundle"
tap "nikitabobko/tap"
tap "silesky/tap"
brew "actionlint"
brew "atuin"
brew "awscli"
brew "node"
brew "bash-language-server"
brew "bat"
brew "btop"
brew "less"
brew "clippy"
brew "python@3.14"
brew "codespell"
brew "cpulimit"
brew "curl"
brew "curlie"
brew "delve"
brew "deno"
brew "git-delta"
brew "diffnav"
brew "direnv"
brew "dust"
brew "entr"
brew "eslint_d"
brew "eza"
brew "fd"
brew "fish"
brew "fzf"
brew "gh"
brew "gitleaks"
brew "glow"
brew "gnupg"
brew "go"
brew "gofumpt"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "graphviz"
brew "gum"
brew "harper"
brew "helm"
brew "helm-ls"
brew "hl"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "jira-cli"
brew "jq"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lla"
brew "lnav"
brew "lua-language-server"
brew "neovim"
brew "pastel"
brew "poppler"
brew "prettierd"
brew "procs"
brew "pyright"
brew "ripgrep"
brew "ruby"
brew "rustup"
brew "sd"
brew "sevenzip"
brew "starship"
brew "stylua"
brew "tailwindcss-language-server"
brew "telnet"
brew "terminal-notifier"
brew "tig"
brew "tldr", link: false
brew "tlrc"
brew "unar"
brew "uv"
brew "vscode-langservers-extracted"
brew "watch"
brew "wget"
brew "xan"
brew "yaml-language-server"
brew "yarn"
brew "yazi"
brew "yq"
brew "common-fate/granted/granted"
brew "felixkratz/formulae/borders"
brew "felixkratz/formulae/sketchybar"
brew "go-task/tap/go-task"
brew "silesky/tap/node-run"
# gh-dash is managed as a GitHub CLI extension: gh extension install dlvhdr/gh-dash
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "arc"
cask "betterdisplay"
cask "discord"
cask "docker-desktop"
cask "font-commit-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "git-credential-manager"
cask "hiddenbar"
cask "homerow"
cask "keycastr"
cask "obsidian"
cask "redis-insight"
cask "slack"
cask "stats"
cask "ticktick"
cask "zoom"
