# Core taps for third-party tools
tap "FelixKratz/formulae"
tap "koekeishiya/formulae"
tap "nikitabobko/tap"
tap "kdash-rs/kdash"
tap "minorole/tap"

# Window management and status bar
brew "FelixKratz/formulae/sketchybar"
brew "FelixKratz/formulae/borders"

# Shell experience
brew "atuin"
brew "carapace"
brew "direnv"
brew "starship"
brew "zoxide"
brew "zsh-autosuggestions"
brew "minorole/tap/gpane"

# Terminal utilities referenced in the dotfiles
brew "bat"
brew "cmatrix"
brew "eza"
brew "fd"
brew "fzf"
brew "jq"
brew "nmap"
brew "ranger"
brew "ripgrep"
brew "silicon"
brew "stow"
brew "tree"
brew "tldr"
brew "xh"
brew "yamlfmt"
brew "bmon"
brew "ctop"
brew "bpytop"
brew "httpie"
brew "lazydocker"
brew "lazygit"
brew "git-extras"
brew "zsh-autosuggestions"
brew "zsh-syntax-highlighting"
brew "wget"

# Language runtimes & tooling
brew "go"
brew "gopls"
brew "node"
brew "ruby"
brew "stylua"

# Cloud & developer CLIs
brew "awscli"
brew "gh"
brew "kubernetes-cli"
brew "kubectx"
brew "kdash"

# Text editor
brew "neovim"

# Apps that need casks
cask "docker-desktop"
cask "ghostty"
cask "karabiner-elements"
cask "aerospace"
cask "sf-symbols"
