tap "abhimanyu003/sttr"
tap "ankitpokhrel/jira-cli"
tap "caarlos0/tap"
tap "charmbracelet/tap"
tap "common-fate/granted"
tap "deviceinsight/packages"
tap "dhth/tap"
tap "dlvhdr/formulae"
tap "f1bonacc1/tap"
tap "friendsofgo/tap"
tap "go-task/tap"
tap "homebrew/bundle"
tap "joshmedeski/sesh"
tap "kenzo-wada/thanks-stars"
tap "marle3003/tap"
tap "morantron/tmux-fingers"
tap "muesli/tap"
tap "nikitabobko/aerospace"
tap "nikitabobko/tap"
tap "pamburus/tap"
tap "pear-devs/pear"
tap "silesky/tap"
tap "skatkov/tap"
tap "thezoraiz/ascii-image-converter"
brew "actionlint"
brew "arttime"
brew "atuin"
brew "awscli"
brew "node"
brew "bash-language-server"
brew "bat"
brew "btop"
brew "cfonts"
brew "less"
brew "circumflex"
brew "clippy"
brew "python@3.14"
brew "codespell"
brew "cpulimit"
brew "curl"
brew "curlie"
brew "delve"
brew "deno"
brew "git-delta"
brew "diffnav"
brew "direnv"
brew "dust"
brew "entr"
brew "eslint_d"
brew "eza"
brew "fd"
brew "figlet"
brew "fish"
brew "fx"
brew "gitleaks"
brew "gitmux"
brew "glow"
brew "gnupg"
brew "gofumpt"
brew "gojq"
brew "golangci-lint"
brew "gopls"
brew "goreleaser"
brew "graphviz"
brew "gum"
brew "harper"
brew "helm"
brew "helm-ls"
brew "hl"
brew "httpie"
brew "hyperfine"
brew "imagemagick"
brew "jira-cli"
brew "jnv"
brew "jq"
brew "jqp"
brew "kafkactl"
brew "kcat"
brew "kind"
brew "kubernetes-cli"
brew "kubectx"
brew "lazygit"
brew "lla"
brew "lnav"
brew "lolcat"
brew "lua-language-server"
brew "minikube"
brew "navi"
brew "neovim"
brew "sesh"
brew "okteto"
brew "onefetch"
brew "pastel"
brew "poppler"
brew "posting"
brew "presenterm"
brew "prettierd"
brew "procs"
brew "pyright"
brew "resterm"
brew "ripgrep"
brew "rustup"
brew "sd"
brew "sevenzip"
brew "sl"
brew "starship"
brew "stylua"
brew "tailwindcss-language-server"
brew "telnet"
brew "terminal-notifier"
brew "tig"
brew "tldr", link: false
brew "tlrc"
brew "unar"
brew "uv"
brew "vscode-langservers-extracted"
brew "watch"
brew "wget"
brew "witr"
brew "xan"
brew "yaml-language-server"
brew "yarn"
brew "yazi"
brew "yozefu"
brew "yq"
brew "abhimanyu003/sttr/sttr"
brew "charmbracelet/tap/crush"
brew "charmbracelet/tap/sequin"
brew "charmbracelet/tap/vhs"
brew "common-fate/granted/granted"
brew "dhth/tap/mult"
brew "f1bonacc1/tap/process-compose"
brew "friendsofgo/tap/killgrave"
brew "go-task/tap/go-task"
brew "joshmedeski/sesh/sesh"
brew "kenzo-wada/thanks-stars/thanks-stars"
brew "marle3003/tap/mokapi"
brew "morantron/tmux-fingers/tmux-fingers"
brew "muesli/tap/markscribe"
brew "silesky/tap/node-run"
brew "skatkov/tap/devtui"
brew "thezoraiz/ascii-image-converter/ascii-image-converter"
cask "1password"
cask "1password-cli"
cask "nikitabobko/tap/aerospace"
cask "arc"
cask "betterdisplay"
cask "discord"
cask "docker-desktop"
cask "figma"
cask "font-commit-mono"
cask "font-commit-mono-nerd-font"
cask "font-dejavu-sans-mono-nerd-font"
cask "font-fira-code-nerd-font"
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"
cask "font-symbols-only-nerd-font"
cask "gcloud-cli"
cask "ghostty"
cask "git-credential-manager"
cask "gitify"
cask "hiddenbar"
cask "homerow"
cask "iina"
cask "keycastr"
cask "obsidian"
cask "redis-insight"
cask "slack"
cask "stats"
cask "ticktick"
cask "tomatobar"
cask "zoom"
